Build a recommender system by using cosine simillarties score.

In [ ]:
#import libraries
import pandas as pd
import numpy as np

In [ ]:
#Load the dataset
books=pd.read_csv('/content/book (1).csv',index_col=0,encoding='latin-1')
books.head()

   User.ID                                         Book.Title  Book.Rating
1   276726                                Classical Mythology            5
2   276729                                       Clara Callan            3
3   276729                               Decision in Normandy            6
4   276736  Flu: The Story of the Great Influenza Pandemic...            8
5   276737                             The Mummies of Urumchi            6

In [ ]:
books.shape

(10000, 3)

In [ ]:
len(books['Book.Title'].unique())

9659

Among 10000 records, there are 9659 different books.

In [ ]:
len(books['User.ID'].unique())

2182

We have 2182 different customers.

In [ ]:
user_books=books.pivot_table(index='User.ID',columns='Book.Title',values='Book.Rating')

In [ ]:
user_books_df=pd.DataFrame(user_books)

In [ ]:
user_books_df.shape

(2182, 9659)

In [ ]:
user_books_df.isnull().sum().max()

2181

Replace all the null values with zeroes.

In [ ]:
user_books_df.index = books['User.ID'].unique()

In [ ]:
user_books_df.fillna(0, inplace=True)

In [ ]:
#Calculating Cosine Similarity between Users
from sklearn.metrics import pairwise_distances
from scipy.spatial.distance import cosine, correlation

In [ ]:
user_sim = 1 - pairwise_distances( user_books_df.values,metric='cosine')

In [ ]:
#Store the results in a dataframe
user_sim_df = pd.DataFrame(user_sim)

In [ ]:
#Set the index and column names to user ids 
user_sim_df.index = books['User.ID'].unique()
user_sim_df.columns = books['User.ID'].unique()

In [ ]:
user_sim_df.iloc[0:5, 0:5]

        276726  276729  276736  276737  276744
276726     1.0     0.0     0.0     0.0     0.0
276729     0.0     1.0     0.0     0.0     0.0
276736     0.0     0.0     1.0     0.0     0.0
276737     0.0     0.0     0.0     1.0     0.0
276744     0.0     0.0     0.0     0.0     1.0

In [ ]:
np.fill_diagonal(user_sim, 0)
user_sim_df.iloc[0:5, 0:5]

        276726  276729  276736  276737  276744
276726     0.0     0.0     0.0     0.0     0.0
276729     0.0     0.0     0.0     0.0     0.0
276736     0.0     0.0     0.0     0.0     0.0
276737     0.0     0.0     0.0     0.0     0.0
276744     0.0     0.0     0.0     0.0     0.0

In [ ]:
#Most Similar Users
user_sim_df.idxmax(axis=1)[0:15]

276726    276726
276729    276726
276736    276726
276737    276726
276744    276726
276745    276726
276747    276726
276748    161677
276751    276726
276754    276726
276755    276726
276760    276726
276762    276726
276768    276726
276772      1491
dtype: int64

In [ ]:
books[(books['User.ID']==276772) | (books['User.ID']==1491)]

      User.ID                                         Book.Title  Book.Rating
23     276772  If I'd Known Then What I Know Now: Why Not Lea...            7
24     276772  Mary-Kate &amp; Ashley Switching Goals (Mary-K...           10
25     276772                       Tell Me This Isn't Happening           10
4108     1491                                     Fifth business            7